Repository: jimregan/citizens-information-raw
Catalog: en-pl/www.citizensinformation.ie/pl/employment/unemployment_and_redundancy/losing_your_job/losing_job_entitlements.html.txt.tmx
Source language: en
Languages: pl

source: Losing your job - entitlements
pl: Utrata pracy – uprawnienia

source: If you are being dismissed from your job or made redundant you may have certain entitlements including notice and pay for annual leave earned but not taken
pl: W przypadku usunięcia lub zwolnienia z pracy, pracownikowi mogą przysługiwać określone uprawnienia, w tym wypowiedzenie oraz ekwiwalent za należny ale niewykorzystany urlop wypoczynkowy

source: This is a checklist of what your employer must give you when you leave work:
pl: Poniżej znajduje się wykaz świadczeń należnych od pracodawcy w momencie odejścia z pracy:

source: • P45 – a statement of your pay and deductions – see ‘P45’ below
pl: • P45 – zaświadczenie dotyczące wypłat i potrąceń – patrz ‘P45’ poniżej

source: • Pay that you are owed for work you have done – see ‘Pay’ below
pl: • Wypłata należna za pracę wykonaną – patrz ‘Wypłata’ poniżej

source: • Payslip – showing your gross pay and any deductions
pl: • Odcinek wypłaty – z podanym wynagrodzeniem brutto oraz wszystkimi potrąceniami

source: • Payment for annual leave which you have earned but not taken – see ‘Holiday pay’ below
pl: • Ekwiwalent za należny ale niewykorzystany urlop wypoczynkowy – patrz ‘Ekwiwalent za urlop’ poniżej

source: • Payment instead of notice if you have not worked your notice period – see ‘Notice’ below
pl: • Wypłata zamiast okresu wypowiedzenia, jeżeli w okresie wypowiedzenia pracownik nie świadczył pracy – patrz ‘Wypowiedzenie’ poniżej

source: • Information about what happens to your pension scheme if applicable
pl: • Informacja o tym, jak przedstawia się plan emerytalny – jeśli dotyczy

source: When you leave your job your employer must give you a P45
pl: Jeśli pracownik odchodzi z pracy, pracodawca musi przekazać mu formularz P45

source: This is a statement of your pay and the tax, Universal Social Charge (USC) and PRSI to date deducted by your employer. It is a very important document and you need it if:
pl: Jest to dotychczasowy wykaz zarobków oraz potrąceń podatku,Uniwersalne Zaświadczenie Społeczne i składek PRSI odprowadzanych przez pracodawcę

source: • You are starting a new job – to give to your new employer in order to avoid paying emergency tax
pl: Jest to bardzo ważny dokument

source: • You are unemployed – to claim a tax refund, to claim social welfare benefits
pl: Może okazać się niezbędny w sytuacjach:

source: The date on your P45 is the date that you physically leave the job. For tax and social welfare purposes your employment has ceased
pl: • Zmiany pracy - wtedy należy go przekazać nowemu pracodawcy, aby uniknąć płacenia nadzwyczajnego podatku

source: Under employment law, the termination date of your employment may be different – see ‘Payment instead of notice’ below
pl: • Bycia bezrobotnym, co pozwala na ubieganie się o zwrot podatku lub o świadczenia socjalne

source: If your employer does not give you a P45 you should ask for it – see ‘How to apply’ below
pl: Jeśli Twój pracodawca nie przekaże Ci formularza P45, powinieneś upomnieć się o niego – zapoznaj się z informacją poniżej “Jak się ubiegać”

source: You may be entitled to notice if you are being let go from your job
pl: W Irlandii osobom zwalnianym z pracy może przysługiwać zachowanie okresu wypowiedzenia

source: This means that you are given notice that your job will end, and a date in the near future when this will come into effect
pl: Oznacza to, że pracownik otrzymuje powiadomienie, że w najbliższej przyszłości jego praca dobiegnie końca oraz informację o dacie zakończenia pracy

source: The length of notice you are entitled to, will depend in the first place on your contract of employment
pl: Długość okresu wypowiedzenia zależy przede wszystkim od umowy o pracę. Oprócz tego, prawo określa minimalną długość okresu wypowiedzenia

source: In addition, there is a minimum entitlement set out in the Minimum Notice and Terms of Employment Acts 1973–2005
pl: Pracodawca może na mocy umowy o pracę wydłużyć ustawowy okres wypowiedzenia, lecz nie może go skrócić

source: In order to be entitled to the statutory minimum, you must have been working for your employer for at least 13 weeks
pl: Ustawowy minimalny okres wypowiedzenia przysługuje osobom, które przepracowały dla danego pracodawcy przynajmniej 13 tygodni

source: The amount of notice you are entitled to by law will depend on how long you have been working for your employer
pl: Przysługujący zgodnie z prawem okres wypowiedzenia zależy od okresu przepracowanego dla danego pracodawcy

source: Duration of employment Minimum notice
pl: │Czas trwania zatrudnienia │Minimalny okres wypowiedzenia │

source: 13 weeks to 2 years 1 week
pl: │13 tygodni do 2 lat │1 tydzień │

source: 2 years to 5 years 2 weeks
pl: │2 do 5 lat │2 tygodnie │

source: 5 years to 10 years 4 weeks
pl: │5 do 10 lat │4 tygodnie │

source: 10 years to 15 years 6 weeks
pl: │10 do 15 lat │6 tygodni │

source: 15 years or more 8 weeks
pl: │15 lat lub więcej │8 tygodni │

source: While the notice entitlements under your contract of employment can exceed the minimim periods above, any provision for notice in your contract for less then the above is invalid
pl: Przysługujący na mocy umowy o pracę okres wypowiedzenia może być dłuższy od minimalnych okresów wymienionych powyżej, przy czym jakiekolwiek postanowienie umowy o pracę ograniczające okres wypowiedzenia jest nieważne

source: This essentially means that while your contract of employment can set down that you will receive a greater amount of notice than the law states above, you cannot get less, even if your contract says this
pl: Oznacza to zasadniczo, że umowa o pracę może przewidywać dłuższy okres wypowiedzenia od określonego w ustawie. Jeśli natomiast umowa przewiduje okres wypowiedzenia krótszy niż ustawowy, ta część umowy, która zawiera takie postanowienie, nie odnosi skutków prawnych

source: You may be required to work the notice period or you may accept payment in lieu of notice, if offered
pl: W okresie wypowiedzenia może zaistnieć konieczność pracy, albo też pracownik może przyjąć ewentualna propozycję wypłaty w miejsce pracy

source: Payment in lieu of notice means that you will not have to work for the period between receiving notice and the ending of your employment, but you will get the same amount of wages that you would have received, had you worked
pl: Wypłata zamiast wypowiedzenia oznacza, że w okresie pomiędzy otrzymaniem wypowiedzenia a zakończeniem zatrudnienia nie będzie świadczyć pracy, niemniej otrzyma wynagrodzenie w takiej wysokości, jakie otrzymałby pracując

source: This payment is not regarded as wages or salary but as compensation for loss of employment, which may qualify for tax relief
pl: Wypłata taka nie jest postrzegana jako wynagrodzenie czy pensja, ale jako kompensata za utratę zatrudnienia

source: However, if your contract of employment provides for a payment of this kind on termination of the contract or if you work for the period of notice, you pay tax and PRSI in the normal way
pl: W związku z tym, nie stanowi podstawy do normalnego opodatkowania ani do potrącenia składki na ubezpieczenie społeczne (PRSI)

source: If you get payment in lieu of notice you are considered to be unemployed and available for work during this period. This means that you can claim a jobseeker’s payment. You cannot claim a jobseeker’s payment for any day that you are receiving holiday pay (see below)
pl: (Jeśli w okresie wypowiedzenia pracownik kontynuuje pracę bądź jeśli za okres wypowiedzenia zamiast kwoty ryczałtowej otrzymuje wynagrodzenie tygodniowe lub miesięczne, wówczas jak zwykle opłaca podatki oraz PRSI.)

source: If you are accepting payment in lieu of notice, the date on your P45 is the date that you physically leave the job
pl: Jeżeli w miejsce wynagrodzenia pracownik otrzymuje wypłatę, wówczas uważany jest za osobę bezrobotną i w okresie tym może podejmować pracę

source: For tax and social welfare purposes your employment has ceased
pl: Oznacza to, że może starać się o zasiłek na poszukiwanie pracy

source: Under section 7 of the Minimum Notice and Terms of Employment Act 1973, if you accept payment in lieu of notice, then the date of termination of your employment is the date on which notice (if it had been given) would have expired
pl: Natomiast nie można występować o zasiłek na poszukiwanie pracy za jakikolwiek dzień, za który wypłacany jest ekwiwalent urlopowy (patrz poniżej)

source: During your period of notice you should receive your normal pay
pl: W trakcie okresu wypowiedzenia pracownik powinien otrzymywać normalne wynagrodzenie

source: This also applies if you are paid in lieu of notice
pl: Dotyczy to również sytuacji, w których pracownik otrzymuje płatność zamiast zachowania okresu wypowiedzenia

source: Waiving your right to notice
pl: Zrzeczenie się prawa do okresu wypowiedzenia

source: Employment legislation sets down that if an employer and an employee agree, the employee can waive their right to notice
pl: W Irlandii przepisy prawne dotyczące zatrudnienia przewidują, że za zgodą pracodawcy, pracownik może zrzec się swojego prawa do okresu wypowiedzenia

source: In addition, where the employer and employee agree, the employer can pay the employee in lieu of notice
pl: Ponadto pracodawca i pracownik mogą wspólnie uzgodnić płatność zamiast wynagrodzenia. Prawa te są określone w ust

source: This right is set down in Section 7 of the Minimum Notice and Terms of Employment Act 1973
pl: 7 Ustawy o minimalnym okresie wypowiedzenia i warunkach zatrudnienia z 1973 roku

source: Your employer may dismiss you without notice for serious misconduct, although you can contest whether your employer was justified in such action
pl: Pracodawca może rozwiązać umowę o pracę bez zachowania okresu wypowiedzenia za poważne naruszenie obowiązków pracowniczych, lecz pracownik może zakwestionować zasadność takiego postępowania

source: If you lose your job you have certain rights and entitlements including the right to be paid for work you have done
pl: W przypadku utraty pracy masz pewne prawa w tym prawo do wypłaty należności za wykonaną pracę

source: If you have not been paid by the date of dismissal or if you are still owed some wages, you have a legal entitlement to be paid for your work
pl: Jeśli do dnia zwolnienia z pracy nie otrzymałeś należnej Ci sumy lub pracodawca zalega z wypłatą, masz prawo do otrzymania zapłaty za swoją pracę

source: Holiday pay: If your employment is ending, you are entitled to receive a payment for annual leave which you have earned but not taken
pl: Wynagrodzenie za urlop: Jeżeli zatrudnienie dobiega końca, pracownik ma prawo do otrzymania ekwiwalentu pieniężnego za niewykorzystany urlop wypoczynkowy, do którego nabył prawo

source: The payment should equal the amount that would have been paid had the annual leave been taken
pl: Wysokość ekwiwalentu powinna być taka, jak kwota, którą wypłacono by pracownikowi, gdyby wykorzystał urlop

source: The ending of employment is the only situation where it is legal to pay an employee instead of giving annual leave
pl: Koniec zatrudnienia to jedyna sytuacja, w której zgodnie z prawem można wypłacić pracownikowi ekwiwalent pieniężny zamiast udzielić mu urlopu wypoczynkowego

source: Public holiday: If your employment stops during the week ending on the day before a public holiday and you have worked for your employer for the previous 4 weeks, you should receive an additional day's pay for the public holiday
pl: Dni ustawowo wolne od pracy: Jeżeli zatrudnienie ustaje w czasie tygodnia kończącego się dniem poprzedzającym dzień ustawowo wolny od pracy, a pracownik pracował u danego pracodawcy przez poprzednie 4 tygodnie, powinien on otrzymać dodatkową wypłatę dniówki za dzień ustawowo wolny od pracy

source: This also applies to part-time employees who have established a right to the public holiday by working at least 40 hours in the previous 5 weeks
pl: Dotyczy to także pracowników zatrudnionych w niepełnym wymiarze czasu, którzy nabyli prawo do dnia ustawowo wolnego od pracy, pracując co najmniej 40 godzin w ciągu poprzednich 5 tygodni

source: Your employer is responsible for giving you your proper notice
pl: Pracodawca odpowiedzialny jest za przekazanie prawidłowego wypowiedzenia

source: If you have difficulty in securing your notice entitlement or if there is a dispute about pay you are owed, your payslip or pay for annual leave you can refer a complaint to the Workplace Relations Commission within 6 months of the dispute or complaint occurring. You must use the online complaint form available on workplacerelations.ie. The time limit may be extended for up to a further 6 months, but only where there is reasonable cause which prevented the complaint being brought within the normal time limit
pl: Jeżeli są trudności w zabezpieczeniu uprawnień związanych z wypowiedzeniem bądź jeżeli zaistniał spór w kwestii należnej wypłaty, odcinka wypłaty bądź ekwiwalentu za urlop, pracownik może złożyć skargę do służb zajmujących się stosunkami w miejscu pracy - patrz 'Gdzie się odwołać' poniżej – wypełniając nowy formularz skargi indywidualnej (pdf)

source: For further information on your employment rights contact the Workplace Relations Commission's Information and Customer Service - see 'Where to apply' below
pl: Jeżeli pracownik nie otrzymał formularza P45, odchodząc z pracy, powinien najpierw poprosić o niego pracodawcę

source: If you are not given a P45 when you leave your job you should first ask your employer for it
pl: Jeżeli pracodawca nie wyda go, należy skontaktować się z lokalnym urzędem podatkowym

source: If the employer does not supply it you should contact your tax office. Revenue will contact the employer and obtain your P45 for you
pl: Urząd skarbowy skontaktuje się z pracodawcą i uzyska formularz P45 dla pracownika

source: If you have started a new job, Revenue will send you a new tax credit certificate so you will not have to pay emergency tax in your new job
pl: W przypadku rozpoczęcia nowej pracy urząd skarbowy prześle pracownikowi nowe zaświadczenie o wysokości przysługujących mu ulg (tax credit certificate), by w nowym miejscu pracy nie musiał płacić podatku nadzwyczajnego
